raid_data = {
    "카제로스": {
        "노말": {
            "레벨": 1710,
            "보상": {
                "기본": [
                    {
                        "운명의 파편": 6200,
                        "운명의 파괴석": 880,
                        "운명의 수호석": 1760,
                        "운명의 돌파석": 12,
                        "골드": 14000,
                    },
                    {
                        "운명의 파편": 7900,
                        "운명의 파괴석": 1100,
                        "운명의 수호석": 2200,
                        "운명의 돌파석": 15,
                        "골드": 26000,
                    },
                ],
                "더보기": [
                    {
                        "운명의 파편": 13650,
                        "운명의 파괴석": 1610,
                        "운명의 수호석": 3220,
                        "운명의 돌파석": 50,
                        "골드": -4480,
                    },
                    {
                        "운명의 파편": 20880,
                        "운명의 파괴석": 2760,
                        "운명의 수호석": 5220,
                        "운명의 돌파석": 90,
                        "골드": -8320,
                    },
                ],
            }
        },
        "하드": {
            "레벨": 1730,
            "보상": {
                "기본": [
                    {
                        "운명의 파편": 8300,
                        "운명의 파괴석 결정": 385,
                        "운명의 수호석 결정": 770,
                        "위대한 운명의 돌파석": 7,
                        "골드": 17000,
                    },
                    {
                        "운명의 파편": 10100,
                        "운명의 파괴석 결정": 475,
                        "운명의 수호석 결정": 950,
                        "위대한 운명의 돌파석": 10,
                        "골드": 35000,
                    },
                ],
                "더보기": [
                    {
                        "운명의 파편": 17500,
                        "운명의 파괴석 결정": 750,
                        "운명의 수호석 결정": 1500,
                        "위대한 운명의 돌파석": 30,
                        "골드": -5440,
                    },
                    {
                        "운명의 파편": 29800,
                        "운명의 파괴석 결정": 1320,
                        "운명의 수호석 결정": 2640,
                        "위대한 운명의 돌파석": 50,
                        "골드": -11200,
                    },
                ],
            }
        },
    },
    "세르카": {
        "노말": {
            "레벨": 1710,
            "보상": {
                "기본": [
                    {
                        "운명의 파편": 6200,
                        "운명의 파괴석": 880,
                        "운명의 수호석": 1760,
                        "운명의 돌파석": 12,
                        "골드": 14000,
                    },
                    {
                        "운명의 파편": 7900,
                        "운명의 파괴석": 1100,
                        "운명의 수호석": 2200,
                        "운명의 돌파석": 15,
                        "골드": 21000,
                    },
                ],
                "더보기": [
                    {
                        "운명의 파편": 13650,
                        "운명의 파괴석": 1610,
                        "운명의 수호석": 3220,
                        "운명의 돌파석": 50,
                        "골드": -4480,
                    },
                    {
                        "운명의 파편": 20880,
                        "운명의 파괴석": 2480,
                        "운명의 수호석": 4960,
                        "운명의 돌파석": 82,
                        "골드": -6720,
                    },
                ],
            }
        },
        "하드": {
            "레벨": 1730,
            "보상": {
                "기본": [
                    {
                        "운명의 파편": 8300,
                        "운명의 파괴석 결정": 385,
                        "운명의 수호석 결정": 770,
                        "위대한 운명의 돌파석": 7,
                        "골드": 17500,
                    },
                    {
                        "운명의 파편": 10100,
                        "운명의 파괴석 결정": 475,
                        "운명의 수호석 결정": 950,
                        "위대한 운명의 돌파석": 10,
                        "골드": 26500,
                    },
                ],
                "더보기": [
                    {
                        "운명의 파편": 17500,
                        "운명의 파괴석 결정": 750,
                        "운명의 수호석 결정": 1500,
                        "위대한 운명의 돌파석": 30,
                        "골드": -5680,
                    },
                    {
                        "운명의 파편": 26820,
                        "운명의 파괴석 결정": 1130,
                        "운명의 수호석 결정": 2260,
                        "위대한 운명의 돌파석": 45,
                        "골드": -8480,
                    },
                ],
            }
        },
        "나이트메어": {
            "레벨": 1740,
            "보상": {
                "기본": [
                    {
                        "운명의 파편": 9100,
                        "운명의 파괴석 결정": 405,
                        "운명의 수호석 결정": 810,
                        "위대한 운명의 돌파석": 8,
                        "골드": 21000,
                    },
                    {
                        "운명의 파편": 11000,
                        "운명의 파괴석 결정": 500,
                        "운명의 수호석 결정": 1000,
                        "위대한 운명의 돌파석": 12,
                        "골드": 33000,
                    },
                ],
                "더보기": [
                    {
                        "운명의 파편": 19000,
                        "운명의 파괴석 결정": 860,
                        "운명의 수호석 결정": 1720,
                        "위대한 운명의 돌파석": 36,
                        "골드": -6720,
                    },
                    {
                        "운명의 파편": 32200,
                        "운명의 파괴석 결정": 1430,
                        "운명의 수호석 결정": 2860,
                        "위대한 운명의 돌파석": 60,
                        "골드": -10560,
                    },
                ],
            }
        }
    }
}