refining_data = {
    "무기" : {
        12: {
            "base_prob": 0.05,
            "matrials_cost": {
                "운명의 파편": 15890,
                "운명의 파괴석 결정": 1700,
                "위대한 운명의 돌파석": 17,
                "상급 아비도스 융화 재료": 18,
                "골드": 4050,
            },
            "breath_info": {
                "name": "용암의 숨결",
                "count": 25,
            }
        }, 
        13: {
            "base_prob": 0.05,
            "matrials_cost": {
                "운명의 파편": 17660,
                "운명의 파괴석 결정": 1890,
                "위대한 운명의 돌파석": 19,
                "상급 아비도스 융화 재료": 21,
                "골드": 4500,
            },
            "breath_info": {
                "name": "용암의 숨결",
                "count": 25,
            }
        }, 
        14: {
            "base_prob": 0.04,
            "matrials_cost": {
                "운명의 파편": 19420,
                "운명의 파괴석 결정": 2080,
                "위대한 운명의 돌파석": 21,
                "상급 아비도스 융화 재료": 23,
                "골드": 4950,
            },
            "breath_info": {
                "name": "용암의 숨결",
                "count": 25,
            }
        }, 
        15: {
            "base_prob": 0.04,
            "matrials_cost": {
                "운명의 파편": 21190,
                "운명의 파괴석 결정": 2270,
                "위대한 운명의 돌파석": 23,
                "상급 아비도스 융화 재료": 25,
                "골드": 5400,
            },
            "breath_info": {
                "name": "용암의 숨결",
                "count": 25,
            }
        }, 
        16: {
            "base_prob": 0.04,
            "matrials_cost": {
                "운명의 파편": 22960,
                "운명의 파괴석 결정": 2460,
                "위대한 운명의 돌파석": 25,
                "상급 아비도스 융화 재료": 27,
                "골드": 5850,
            },
            "breath_info": {
                "name": "용암의 숨결",
                "count": 25,
            }
        }, 
        17: {
            "base_prob": 0.03,
            "matrials_cost": {
                "운명의 파편": 25120,
                "운명의 파괴석 결정": 2690,
                "위대한 운명의 돌파석": 28,
                "상급 아비도스 융화 재료": 29,
                "골드": 6400,
            },
            "breath_info": {
                "name": "용암의 숨결",
                "count": 25,
            }
        }, 
        18: {
            "base_prob": 0.03,
            "matrials_cost": {
                "운명의 파편": 27080,
                "운명의 파괴석 결정": 2900,
                "위대한 운명의 돌파석": 30,
                "상급 아비도스 융화 재료": 32,
                "골드": 6900,
            },
            "breath_info": {
                "name": "용암의 숨결",
                "count": 25,
            }
        },
        19: {
            "base_prob": 0.03,
            "matrials_cost": {
                "운명의 파편": 29040,
                "운명의 파괴석 결정": 3110,
                "위대한 운명의 돌파석": 32,
                "상급 아비도스 융화 재료": 34,
                "골드": 7400,
            },
            "breath_info": {
                "name": "용암의 숨결",
                "count": 25,
            }
        },
        20: {
            "base_prob": 0.015,
            "matrials_cost": {
                "운명의 파편": 31200,
                "운명의 파괴석 결정": 3340,
                "위대한 운명의 돌파석": 34,
                "상급 아비도스 융화 재료": 37,
                "골드": 7950,
            },
            "breath_info": {
                "name": "용암의 숨결",
                "count": 25,
            }
        },
        21: {
            "base_prob": 0.015,
            "matrials_cost": {
                "운명의 파편": 33360,
                "운명의 파괴석 결정": 3570,
                "위대한 운명의 돌파석": 37,
                "상급 아비도스 융화 재료": 39,
                "골드": 8500,
            },
            "breath_info": {
                "name": "용암의 숨결",
                "count": 50,
            }
        },
        22: {
            "base_prob": 0.01,
            "matrials_cost": {
                "운명의 파편": 35520,
                "운명의 파괴석 결정": 3800,
                "위대한 운명의 돌파석": 39,
                "상급 아비도스 융화 재료": 42,
                "골드": 9050,
            },
            "breath_info": {
                "name": "용암의 숨결",
                "count": 50,
            }
        },
        23: {
            "base_prob": 0.01,
            "matrials_cost": {
                "운명의 파편": 37680,
                "운명의 파괴석 결정": 4030,
                "위대한 운명의 돌파석": 42,
                "상급 아비도스 융화 재료": 44,
                "골드": 9600,
            },
            "breath_info": {
                "name": "용암의 숨결",
                "count": 50,
            }
        },
        24: {
            "base_prob": 0.005,
            "matrials_cost": {
                "운명의 파편": 39840,
                "운명의 파괴석 결정": 4260,
                "위대한 운명의 돌파석": 44,
                "상급 아비도스 융화 재료": 47,
                "골드": 10150,
            },
            "breath_info": {
                "name": "용암의 숨결",
                "count": 100,
            }
        },
        25: {
            "base_prob": 0.005,
            "matrials_cost": {
                "운명의 파편": 42000,
                "운명의 파괴석 결정": 4500,
                "위대한 운명의 돌파석": 47,
                "상급 아비도스 융화 재료": 50,
                "골드": 10700,
            },
            "breath_info": {
                "name": "용암의 숨결",
                "count": 100,
            }
        },
    },
    "방어구" : {
        12: {
            "base_prob": 0.05,
            "matrials_cost": {
                "운명의 파편": 9570,
                "운명의 수호석 결정": 930,
                "위대한 운명의 돌파석": 11,
                "상급 아비도스 융화 재료": 11,
                "골드": 2450,
            },
            "breath_info": {
                "name": "빙하의 숨결",
                "count": 25,
            }
        }, 
        13: {
            "base_prob": 0.05,
            "matrials_cost": {
                "운명의 파편": 10540,
                "운명의 수호석 결정": 1030,
                "위대한 운명의 돌파석": 12,
                "상급 아비도스 융화 재료": 12,
                "골드": 2700,
            },
            "breath_info": {
                "name": "빙하의 숨결",
                "count": 25,
            }
        }, 
        14: {
            "base_prob": 0.04,
            "matrials_cost": {
                "운명의 파편": 11520,
                "운명의 수호석 결정": 1120,
                "위대한 운명의 돌파석": 13,
                "상급 아비도스 융화 재료": 13,
                "골드": 2950,
            },
            "breath_info": {
                "name": "빙하의 숨결",
                "count": 25,
            }
        }, 
        15: {
            "base_prob": 0.04,
            "matrials_cost": {
                "운명의 파편": 12690,
                "운명의 수호석 결정": 1240,
                "위대한 운명의 돌파석": 14,
                "상급 아비도스 융화 재료": 15,
                "골드": 3250,
            },
            "breath_info": {
                "name": "빙하의 숨결",
                "count": 25,
            }
        }, 
        16: {
            "base_prob": 0.04,
            "matrials_cost": {
                "운명의 파편": 13670,
                "운명의 수호석 결정": 1330,
                "위대한 운명의 돌파석": 15,
                "상급 아비도스 융화 재료": 16,
                "골드": 3500,
            },
            "breath_info": {
                "name": "빙하의 숨결",
                "count": 25,
            }
        }, 
        17: {
            "base_prob": 0.03,
            "matrials_cost": {
                "운명의 파편": 14840,
                "운명의 수호석 결정": 1450,
                "위대한 운명의 돌파석": 17,
                "상급 아비도스 융화 재료": 17,
                "골드": 3800,
            },
            "breath_info": {
                "name": "빙하의 숨결",
                "count": 25,
            }
        }, 
        18: {
            "base_prob": 0.03,
            "matrials_cost": {
                "운명의 파편": 16010,
                "운명의 수호석 결정": 1560,
                "위대한 운명의 돌파석": 18,
                "상급 아비도스 융화 재료": 19,
                "골드": 4100,
            },
            "breath_info": {
                "name": "빙하의 숨결",
                "count": 25,
            }
        },
        19: {
            "base_prob": 0.03,
            "matrials_cost": {
                "운명의 파편": 17380,
                "운명의 수호석 결정": 1700,
                "위대한 운명의 돌파석": 20,
                "상급 아비도스 융화 재료": 20,
                "골드": 4450,
            },
            "breath_info": {
                "name": "빙하의 숨결",
                "count": 25,
            }
        },
        20: {
            "base_prob": 0.015,
            "matrials_cost": {
                "운명의 파편": 18550,
                "운명의 수호석 결정": 1810,
                "위대한 운명의 돌파석": 21,
                "상급 아비도스 융화 재료": 22,
                "골드": 4750,
            },
            "breath_info": {
                "name": "빙하의 숨결",
                "count": 25,
            }
        },
        21: {
            "base_prob": 0.015,
            "matrials_cost": {
                "운명의 파편": 19920,
                "운명의 수호석 결정": 1950,
                "위대한 운명의 돌파석": 23,
                "상급 아비도스 융화 재료": 23,
                "골드": 5100,
            },
            "breath_info": {
                "name": "빙하의 숨결",
                "count": 50,
            }
        },
        22: {
            "base_prob": 0.01,
            "matrials_cost": {
                "운명의 파편": 21280,
                "운명의 수호석 결정": 2080,
                "위대한 운명의 돌파석": 24,
                "상급 아비도스 융화 재료": 25,
                "골드": 5450,
            },
            "breath_info": {
                "name": "빙하의 숨결",
                "count": 50,
            }
        },
        23: {
            "base_prob": 0.01,
            "matrials_cost": {
                "운명의 파편": 22460,
                "운명의 수호석 결정": 2200,
                "위대한 운명의 돌파석": 26,
                "상급 아비도스 융화 재료": 26,
                "골드": 5750,
            },
            "breath_info": {
                "name": "빙하의 숨결",
                "count": 50,
            }
        },
        24: {
            "base_prob": 0.005,
            "matrials_cost": {
                "운명의 파편": 23820,
                "운명의 수호석 결정": 2330,
                "위대한 운명의 돌파석": 27,
                "상급 아비도스 융화 재료": 28,
                "골드": 6100,
            },
            "breath_info": {
                "name": "빙하의 숨결",
                "count": 100,
            }
        },
        25: {
            "base_prob": 0.005,
            "matrials_cost": {
                "운명의 파편": 25000,
                "운명의 수호석 결정": 2450,
                "위대한 운명의 돌파석": 29,
                "상급 아비도스 융화 재료": 30,
                "골드": 6400,
            },
            "breath_info": {
                "name": "빙하의 숨결",
                "count": 100,
            }
        },
    }
}